---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DivisionSketchCurveExtentdToSilhParam
source: html/d40324a9-4639-ca86-558f-c47c2de3c32c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DivisionSketchCurveExtentdToSilhParam Property

"Extend to Silhouette"

## Syntax (C#)
```csharp
public static ForgeTypeId DivisionSketchCurveExtentdToSilhParam { get; }
```